In [2]:
import pandas as pd        
df = pd.read_csv('data/titanic_train.csv',sep=',')        # csv : ','로 구분 지어진 파일

In [44]:
df = pd.DataFrame(df)
df
#df.apply(split(','))

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.00,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.00,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,2,1,"Duran y More, Miss. Florentina",female,30.00,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,3,1,"Bradley, Miss. Bridget Delia",female,22.00,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
911,3,1,"Dean, Miss. Elizabeth Gladys ""Millvina""",female,0.17,1,2,C.A. 2315,20.5750,NaN,S,NaN,"Devon, England Wichita, KS"
912,3,0,"Guest, Mr. Robert",male,NaN,0,0,376563,8.0500,NaN,S,NaN,NaN
913,3,1,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,NaN,NaN
914,2,1,"Sincock, Miss. Maude",female,20.00,0,0,C.A. 33112,36.7500,NaN,S,NaN,"Cornwall / Hancock, MI"
915,3,0,"Bourke, Mrs. John (Catherine)",female,32.00,1,1,364849,15.5000,NaN,Q,NaN,"Ireland Chicago, IL"

In [41]:
import pandas as pd        
df2 = pd.read_csv('data/ex1.csv', names=['a', 'b', 'c', 'd', "message"], index_col="message")        # csv : ','로 구분 지어진 파일
df2

         a  b  c  d
message
nihao    a  b  c  d
hi       e  f  g  h
man      q  w  e  r
bro      z  x  c  v

In [46]:
f = open("data/csv_mindex.csv", 'w')
data = """key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16
"""
f.write(data)
f.close()

In [57]:
# 계층적 색인 지정, 멀티 인덱스
import pandas as pd        
parsed = pd.read_csv("data/csv_mindex.csv", index_col=["key1", "key2"])      
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [62]:
f = open("data/ex3.txt", 'w')
data = """
            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871859 -0.348382  1.100491
"""
f.write(data)
f.close()

In [64]:
import pandas as pd        
parsed = pd.read_csv("data/ex3.txt", sep= '\s+')      # sep= '\s+' : 정확한 입력 공간별 데이터 구분
parsed                                               # sep= '\s+' 없이 하면 열이 맞지 않음

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871859 -0.348382  1.100491

In [84]:
f = open("data/ex4.csv", 'w')
data = """#Hey!
a,b,c,d,message
# Hello Python
# CSV file
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo
"""
f.write(data)
f.close()

In [94]:
ff = open("data/ex4.csv", mode='r', encoding="utf-8")
count = 0
check = []

while True:
    contents = ff.readline()
    if not contents:
        break
    if "#" in contents:
        check.append(count)
    count +=1
check

[0, 2, 3]

In [3]:
import pandas as pd   

parsed = pd.read_csv("data/ex4.csv", skiprows=[0, 2, 3])     # skiporws : 불필요한 row를 삭제
parsed

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [116]:
import pandas as pd   
result = pd.read_csv("data/ex5.csv")     
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [113]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [7]:
result = pd.read_csv("data/ex5.csv", na_values=["0"])    # ??
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [4]:
f = open("data/ex5.csv", 'w')
data = """something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo
"""
f.write(data)
f.close()

In [115]:
sentinels = {"message" : ["foo", "NA"], "something" : ["two"]}  # ??
result = pd.read_csv("data/ex5.csv", na_values=sentinels)
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [111]:
# 엑셀 파일 읽기
 
frame = pd.read_excel("data/ex01.xlsx", "Sheet1")
frame

# 엑셀 파일 저장

writer = pd.ExcelWriter("data/ex02.xlsx")
frame.to_excel(writer, "Sheet1")
writer.save()

In [117]:
#===============================================================================================================

In [118]:
# 누락된 데이터 처리
import numpy as np 
import pandas as pd 
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [120]:
'''
|인자|설명|
|------:|---|
|dropna|누락된 데이터가 있는 축(low,column)을 제외시킨다. 어느정도의 누락데이터까지 용인할것인지 지정 할 수 있다.|
|fillna|누락된 데이터를 대신할 값을 채우거나 'ffill'이나 'bfill'같은 보간 메서드를 적용한다.|
|isnull|누락되거나 NA인 값을 알려주는 불리언 값이 저장된 같은 형의 객체를 반환|
|notnull|isnull과 반대되는 메서드|
'''

"\n|인자|설명|\n|------:|---|\n|dropna|누락된 데이터가 있는 축(low,column)을 제외시킨다. 어느정도의 누락데이터까지 용인할것인지 지정 할 수 있다.|\n|fillna|누락된 데이터를 대신할 값을 채우거나 'ffill'이나 'bfill'같은 보간 메서드를 적용한다.|\n|isnull|누락되거나 NA인 값을 알려주는 불리언 값이 저장된 같은 형의 객체를 반환|\n|notnull|isnull과 반대되는 메서드|\n"

In [121]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()                            # data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [123]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data.dropna()           # dropna() : NaN이 하나라도 들어 있으면 삭제

     0    1    2
0  1.0  6.5  3.0

In [124]:
cleand = data.dropna(how="all")     # how=all : 모두 NaN이면 삭제
cleand

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [125]:
# 4번 열을 추가하고 NA값으로 지정
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [126]:
cleand = data.dropna(axis="columns", how="all")    # axis="columns"  // sxis = 1
cleand

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [131]:
df[:4][1] = NA
df[:2][2] = NA
df

          0         1         2
0  0.821788       NaN       NaN
1  0.351968       NaN       NaN
2 -0.132973       NaN  0.772082
3  0.972808       NaN -0.133903
4 -0.185658  0.266344  1.754866
5  0.766807  0.489190  1.390894
6 -0.131603 -1.001054 -1.601450

In [129]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.821788  0.164182  0.235484
1  0.351968 -1.250957 -0.819372
2 -0.132973  0.815992  0.772082
3  0.972808  0.344352 -0.133903
4 -0.185658  0.266344  1.754866
5  0.766807  0.489190  1.390894
6 -0.131603 -1.001054 -1.601450

In [141]:
df.dropna(thresh=2)     # NaN 2개짜리 drop

          0         1         2
2 -0.132973       NaN  0.772082
3  0.972808       NaN -0.133903
4 -0.185658  0.266344  1.754866
5  0.766807  0.489190  1.390894
6 -0.131603 -1.001054 -1.601450

In [142]:
# 결측치 채우기
df.fillna(0)    # 결측치 0으로 채우기
# df.fillna(0, inplace=True)   : 실행시 df에 바로 업데이트

          0         1         2
0  0.821788  0.000000  0.000000
1  0.351968  0.000000  0.000000
2 -0.132973  0.000000  0.772082
3  0.972808  0.000000 -0.133903
4 -0.185658  0.266344  1.754866
5  0.766807  0.489190  1.390894
6 -0.131603 -1.001054 -1.601450

In [145]:
df.fillna({1:0.9, 2:0})     # 1열일때는 0.9, 2열일때 0

          0         1         2
0  0.821788  0.900000  0.000000
1  0.351968  0.900000  0.000000
2 -0.132973  0.900000  0.772082
3  0.972808  0.900000 -0.133903
4 -0.185658  0.266344  1.754866
5  0.766807  0.489190  1.390894
6 -0.131603 -1.001054 -1.601450

In [146]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.307659  1.699349  0.152454
1  2.836623  1.105187 -0.106506
2 -0.560486       NaN -0.507764
3 -1.248912       NaN -0.657437
4 -0.802963       NaN       NaN
5 -1.481798       NaN       NaN

In [148]:
df.fillna(method="ffill")       # 보간법을 통해 NA값을 채움
df.fillna(method="ffill", limit=2)    # 아래쪽으로 2개까지만 채움

          0         1         2
0  0.307659  1.699349  0.152454
1  2.836623  1.105187 -0.106506
2 -0.560486  1.105187 -0.507764
3 -1.248912  1.105187 -0.657437
4 -0.802963       NaN -0.657437
5 -1.481798       NaN -0.657437

In [149]:
'''
df.fill(value, method="ffill", axis=0, inplace= , limit) 
value : 비어있는 값을 채울 스칼라 값이나 dictionary 형식의 객체
method : 보간법 (default : ffill)
axis : 값을 채울 축 (default : 0)
inplace : 복사본을 생성하지 않고 호출한 객체에 값을 반환 (default : False)
limit : 값을 앞 또는 뒤로 몇개까지 채울지 지정
'''

'\ndf.fill(value, method="ffill", axis=0, inplace= , limit) \nvalue : 비어있는 값을 채울 스칼라 값이나 dictionary 형식의 객체\nmethod : 보간법 (default : ffill)\naxis : 값을 채울 축 (default : 0)\ninplace : 복사본을 생성하지 않고 호출한 객체에 값을 반환 (default : False)\nlimit : 값을 앞 또는 뒤로 몇개까지 채울지 지정\n'

In [150]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [151]:
data.duplicated() # 죽복이 되어 있는지. 5행과 6행 중복

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [152]:
data.drop_duplicates()  # 중복제거

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [153]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [156]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [157]:
data.drop_duplicates(["k2"])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [159]:
data.drop_duplicates(["k1", "k2"], keep="last") # 5,6행이 중복이었는데 keep="last"

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [169]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [170]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [172]:
lower_cased = data["food"].str.lower()  # lower: 소문자로 바꿈
lower_cased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [166]:
data["meat_to_animal"] = lower_cased.map(meat_to_animal)   # 매핑 후 새로운 열 생성
# data["meat_to_animal"] = data["food"].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces meat_to_animal
0        bacon     4.0            pig
1  pulled pork     3.0            pig
2        bacon    12.0            pig
3     Pastrami     6.0            cow
4  corned beef     7.5            cow
5        Bacon     8.0            pig
6     pastrami     3.0            cow
7    honey ham     5.0            pig
8     nova lox     6.0         salmon

In [182]:
data = pd.Series([1., -999., 2., -999., -1000., 3.,])
data.replace(-999., NA)
# data.replac(-999., np.nan)
data.replace({-999: NA, -1000: 0})  # -999를 NA로, -1000을 0으로

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [184]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [189]:
transform = lambda x : x[:4].upper()
data.index.map(transform)
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [192]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [193]:
data.rename(index={"OHIO":"INDIANA"}, columns={"three":"peekaboo"}) # 일부만 변경
# data.rename(index={"OHIO":"INDIANA"}, columns={"three":"peekaboo"}, inplace=True)

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [3]:
# 18~25, 26~35, 36~60, 60~100 범위로 나누기
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] 
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)   # 18초과 25이하 // 왼쪽은 포함x, 오른쪽은 포함
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [9]:
cats.codes  # 18~25: 0, 26~35 : 1, 36~60 : 2, 61 ~: 3

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [6]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [203]:
cats = pd.cut(ages, [18,26,36,60,100], right=False) # 18이상 26미만// 왼쪽은 포함, 오른쪽은 포함x
cats

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [207]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [209]:
data = np.random.rand(20)
data

array([0.14234067, 0.81723348, 0.75321392, 0.927514  , 0.50526687,
       0.60631229, 0.67038613, 0.32979328, 0.9315445 , 0.43201702,
       0.54896232, 0.34026705, 0.76216242, 0.11459342, 0.86160481,
       0.87277494, 0.26832276, 0.39823809, 0.40558882, 0.49984288])

In [210]:
pd.cut(data, 4, precision=2)        # precision = 2 : 소수점2자리까지 표시, 4 : max와 min 반올림 정수사이 4등분 한듯

[(0.11, 0.32], (0.73, 0.93], (0.73, 0.93], (0.73, 0.93], (0.32, 0.52], ..., (0.73, 0.93], (0.11, 0.32], (0.32, 0.52], (0.32, 0.52], (0.32, 0.52]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.32] < (0.32, 0.52] < (0.52, 0.73] < (0.73, 0.93]]

In [222]:
data = pd.DataFrame(np.random.randn(1000,4))
data

            0         1         2         3
0   -0.042082 -1.488919  0.414034  0.364807
1    1.046393  0.980125  1.287875 -0.538743
2    0.842175 -1.666046  0.848227 -0.263523
3    0.045929  1.808779 -0.494846 -0.099989
4   -1.212211 -0.744687 -0.146874  0.101666
..        ...       ...       ...       ...
995 -0.032917  1.242053 -1.227035  0.004250
996  0.902371 -2.021629  1.535093 -1.200507
997  2.144257 -1.153856 -0.484826  0.492735
998 -0.444309 -1.728585  0.568969 -0.948541
999  0.344438  0.820067 -0.400077 -1.582411

[1000 rows x 4 columns]

In [223]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008656    -0.059036    -0.049518     0.040202
std       0.960232     1.013811     0.982104     0.967542
min      -2.550518    -2.819012    -3.277140    -2.934825
25%      -0.674667    -0.801586    -0.741497    -0.585681
50%      -0.001849    -0.015672    -0.096865     0.031244
75%       0.627403     0.642233     0.621663     0.697838
max       3.471733     2.905526     3.736512     3.404274

In [225]:
col = data[2]
col[np.abs(col) > 3]

10    3.736512
72   -3.277140
Name: 2, dtype: float64

In [227]:
data[(np.abs(data)>3).any(1)]   # 데이터 3보다 큰게 있으면 출력

            0         1         2         3
10  -1.535120  2.117693  3.736512 -0.947040
72   1.196662 -1.956661 -3.277140 -1.013301
729 -1.445985 -0.851580 -0.320642  3.404274
838  3.471733 -1.325570 -1.410248 -0.898727

In [230]:
data[np.abs(data)>3] = np.sign(data)*3  # 3을 넘어가는 값을 3으로 지정
data.describe()                         # np.sign(data) : 부호표시 / 1과 -1을 가지는 데이터

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.009128    -0.059036    -0.049977     0.039797
std       0.958635     1.013811     0.978660     0.966218
min      -2.550518    -2.819012    -3.000000    -2.934825
25%      -0.674667    -0.801586    -0.741497    -0.585681
50%      -0.001849    -0.015672    -0.096865     0.031244
75%       0.627403     0.642233     0.621663     0.697838
max       3.000000     2.905526     3.000000     3.000000

In [233]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [234]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 4, 2, 3])

In [235]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [236]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [237]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
4    4
0    5
1    7
0    5
1    7
3    6
0    5
2   -1
4    4
dtype: int64

In [239]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [240]:
pd.get_dummies(df["key"])   # 자기 값만 1, one hot encoding

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [244]:
dummies = pd.get_dummies(df["key"], prefix="key") # prefix="key" : column index에 key_추가
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [245]:
df_with_dummy = df[["data1"]].join(dummies) # data열과 dummies를 붙임
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [247]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('data/movies.dat', sep='::', header=None, names=mnames)
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [251]:
all_genres = []
for x in movies.genres:                 # append() : 값 1개만 짛어넣어
    all_genres.extend(x.split('|'))     # extend() : 리스트 형태를 집어넣어
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [260]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [264]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [268]:
pd.set_option("display.max_columns", 25)
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,Genre_Action,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [271]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [272]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [284]:
val = "a,b, guido"
val.split(',')

['a', 'b', ' guido']

In [285]:
pieces = [x.strip() for x in val.split(',')]    # split 한 후 빈공간을 x.strip()으로 없앰
pieces                                          # 그냥 바로 저렇게 쓰면 되

['a', 'b', 'guido']

In [289]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [290]:
'::'.join(pieces)

'a::b::guido'

In [291]:
'guido' in val

True

In [292]:
val.index(',')

1

In [293]:
val.find(':')

-1

In [286]:
val.count(',')

2

In [287]:
val.replace(',','::')

'a::b:: guido'

In [288]:
val.replace(',','')

'ab guido'